Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CZ-CA80_DFP/1.2.150/CA80/atdf/PIC32CZ4010CA80176.atdf
      <pin position="113" pad="PG02"/>
      <pin position="114" pad="PC10"/>
      <pin position="115" pad="PC11"/>
      <pin position="116" pad="VDDIO"/>
      <pin position="117" pad="GND"/>
      <pin position="118" pad="PC27"/>
      <pin position="119" pad="PG03"/>
      <pin position="120" pad="PC28"/>
      <pin position="121" pad="PC12"/>
      <pin position="122" pad="PC13"/>
      <pin position="123" pad="PC29"/>
      <pin position="124" pad="PC14"/>
      <pin position="125" pad="PC15"/>
      <pin position="126" pad="VDDF"/>
      <pin position="127" pad="VSSF1"/>
      <pin position="128" pad="RESET_N"/>
      <pin position="129" pad="PC17"/>
      <pin position="130" pad="PC18"/>
      <pin position="131" pad="PC19"/>
      <pin position="132" pad="PC20"/>
      <pin position="133" pad="USBDP0"/>
      <pin position="134" pad="USBDM0"/>
      <pin position="135" pad="USBID0"/>
      <pin position="136" pad="VCCA3P30"/>
      <pin position="137" pad="VSSUSBA"/>
      <pin position="138" pad="VBUS0"/>
      <pin position="139" pad="USBRBIAS0"/>
      <pin position="140" pad="GND"/>
      <pin position="141" pad="VDDREG"/>
      <pin position="142" pad="USBDP1"/>
      <pin position="143" pad="USBDM1"/>
      <pin position="144" pad="USBID1"/>
      <pin position="145" pad="VCCA3P31"/>
      <pin position="146" pad="VSSUSBD"/>
      <pin position="147" pad="VBUS1"/>
      <pin position="148" pad="USBRBIAS1"/>
      <pin position="149" pad="PD00"/>
      <pin position="150" pad="PD01"/>
      <pin position="151" pad="PD13"/>
      <pin position="152" pad="PD23"/>
      <pin position="153" pad="PD14"/>
      <pin position="154" pad="PD02"/>
      <pin position="155" pad="PD03"/>
      <pin position="156" pad="GND"/>
      <pin position="157" pad="VDDIO"/>
      <pin position="158" pad="PD15"/>
      <pin position="159" pad="PD16"/>
      <pin position="160" pad="PD17"/>
      <pin position="161" pad="PD04"/>
      <pin position="162" pad="PD18"/>
      <pin position="163" pad="PD19"/>
      <pin position="164" pad="PD05"/>
      <pin position="165" pad="PD06"/>
      <pin position="166" pad="PD20"/>
      <pin position="167" pad="PD21"/>
      <pin position="168" pad="PD07"/>
      <pin position="169" pad="VDDREG"/>
      <pin position="170" pad="GND"/>
      <pin position="171" pad="VDDIO"/>
      <pin position="172" pad="PD08"/>
      <pin position="173" pad="PD09"/>
      <pin position="174" pad="PD10"/>
      <pin position="175" pad="PD11"/>
      <pin position="176" pad="PD12"/>
    </pinout>
  </pinouts>
</avr-tools-device-file>
